[Killed] BlockStatement
src/InputReader.js:4:19
 const readline = require("readline");
 
 class InputReader {
-    constructor() {
-        // Creates an open interface to read from stdin
-        // IMPORTANT: We need to close the interface when we are done, or we get a hanging program.
-        this.rl = readline.createInterface({
-            input: process.stdin,
-            output: process.stdout,
-        });
-    }
+    constructor() {}
 
     close() {
killedBy: InputReader reads single input
statusReason: TypeError: Cannot read properties of undefined (reading 'close')

[Killed] ObjectLiteral
src/InputReader.js:7:44
     constructor() {
         // Creates an open interface to read from stdin
         // IMPORTANT: We need to close the interface when we are done, or we get a hanging program.
-        this.rl = readline.createInterface({
-            input: process.stdin,
-            output: process.stdout,
-        });
+        this.rl = readline.createInterface({});
     }
 
killedBy: InputReader reads single input
statusReason: TypeError: input.on is not a function

[Killed] BlockStatement
src/InputReader.js:13:13
         });
     }
 
-    close() {
-        this.rl.close();
-    }
+    close() {}
 
     /**
killedBy: InputReader close closes readline
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
src/InputReader.js:21:33
      * @param {Question} question
      * @returns {Promise<number[]>}
      */
-    async readAnswers(question) {
-        return new Promise((resolve) => {
-            let query = "Enter your answer: ";
-            if (question.strategy.maxAnswers > 1) {
-                query = "Enter your answers (separated by a comma): ";
-            }
-            this.rl.question(query, (answer) => {
-                this.handleAnswer(answer, question, query, resolve);
-            });
-        });
-    }
+    async readAnswers(question) {}
 
     /**
killedBy: InputReader reads single input
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Timeout] BlockStatement
src/InputReader.js:22:41
      * @returns {Promise<number[]>}
      */
     async readAnswers(question) {
-        return new Promise((resolve) => {
-            let query = "Enter your answer: ";
-            if (question.strategy.maxAnswers > 1) {
-                query = "Enter your answers (separated by a comma): ";
-            }
-            this.rl.question(query, (answer) => {
-                this.handleAnswer(answer, question, query, resolve);
-            });
-        });
+        return new Promise((resolve) => {});
     }
 

[Killed] StringLiteral
src/InputReader.js:23:25
      */
     async readAnswers(question) {
         return new Promise((resolve) => {
-            let query = "Enter your answer: ";
+            let query = "";
             if (question.strategy.maxAnswers > 1) {
                 query = "Enter your answers (separated by a comma): ";
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Enter your answer: "
Received: ""

[Killed] EqualityOperator
src/InputReader.js:24:17
     async readAnswers(question) {
         return new Promise((resolve) => {
             let query = "Enter your answer: ";
-            if (question.strategy.maxAnswers > 1) {
+            if (question.strategy.maxAnswers <= 1) {
                 query = "Enter your answers (separated by a comma): ";
             }
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Enter your answer: "
Received: "Enter your answers (separated by a comma): "

[Killed] BlockStatement
src/InputReader.js:24:51
     async readAnswers(question) {
         return new Promise((resolve) => {
             let query = "Enter your answer: ";
-            if (question.strategy.maxAnswers > 1) {
-                query = "Enter your answers (separated by a comma): ";
-            }
+            if (question.strategy.maxAnswers > 1) {}
             this.rl.question(query, (answer) => {
                 this.handleAnswer(answer, question, query, resolve);
killedBy: InputReader reads multiple inputs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Enter your answers (separated by a comma): "
Received: "Enter your answer: "

[Timeout] BlockStatement
src/InputReader.js:27:49
             if (question.strategy.maxAnswers > 1) {
                 query = "Enter your answers (separated by a comma): ";
             }
-            this.rl.question(query, (answer) => {
-                this.handleAnswer(answer, question, query, resolve);
-            });
+            this.rl.question(query, (answer) => {});
         });
     }

[Timeout] BlockStatement
src/InputReader.js:36:52
     /**
      * @private
      */
-    handleAnswer(answer, question, query, resolve) {
-        const invalidAnswers = this.getInvalidAnswers(answer, question);
-
-        if (invalidAnswers.length > 0) {
-            const invalidQueryTryAgain = `Invalid choice${
-                invalidAnswers.length > 1 ? "s" : ""
-            }: ${invalidAnswers.join(", ")}\n${query}`;
-            this.rl.question(invalidQueryTryAgain, (answer) => {
-                this.handleAnswer(answer, question, query, resolve);
-            });
-            return;
-        }
-
-        resolve(answer.split(",").map((string) => parseInt(string)));
-    }
+    handleAnswer(answer, question, query, resolve) {}
 
     /**

[Killed] ConditionalExpression
src/InputReader.js:39:13
     handleAnswer(answer, question, query, resolve) {
         const invalidAnswers = this.getInvalidAnswers(answer, question);
 
-        if (invalidAnswers.length > 0) {
+        if (false) {
             const invalidQueryTryAgain = `Invalid choice${
                 invalidAnswers.length > 1 ? "s" : ""
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/InputReader.js:39:13
     handleAnswer(answer, question, query, resolve) {
         const invalidAnswers = this.getInvalidAnswers(answer, question);
 
-        if (invalidAnswers.length > 0) {
+        if (invalidAnswers.length <= 0) {
             const invalidQueryTryAgain = `Invalid choice${
                 invalidAnswers.length > 1 ? "s" : ""
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 
  Enter your answer:

[Killed] StringLiteral
src/InputReader.js:40:42
         const invalidAnswers = this.getInvalidAnswers(answer, question);
 
         if (invalidAnswers.length > 0) {
-            const invalidQueryTryAgain = `Invalid choice${
-                invalidAnswers.length > 1 ? "s" : ""
-            }: ${invalidAnswers.join(", ")}\n${query}`;
+            const invalidQueryTryAgain = ``;
             this.rl.question(invalidQueryTryAgain, (answer) => {
                 this.handleAnswer(answer, question, query, resolve);
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid choices: 3, 5
Enter your answer: "
Received: ""

[Killed] EqualityOperator
src/InputReader.js:41:17
 
         if (invalidAnswers.length > 0) {
             const invalidQueryTryAgain = `Invalid choice${
-                invalidAnswers.length > 1 ? "s" : ""
+                invalidAnswers.length <= 1 ? "s" : ""
             }: ${invalidAnswers.join(", ")}\n${query}`;
             this.rl.question(invalidQueryTryAgain, (answer) => {
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Invalid choices: 3, 5
+ Invalid choice: 3, 5
  Enter your answer:

[Killed] EqualityOperator
src/InputReader.js:41:17
 
         if (invalidAnswers.length > 0) {
             const invalidQueryTryAgain = `Invalid choice${
-                invalidAnswers.length > 1 ? "s" : ""
+                invalidAnswers.length >= 1 ? "s" : ""
             }: ${invalidAnswers.join(", ")}\n${query}`;
             this.rl.question(invalidQueryTryAgain, (answer) => {
killedBy: InputReader detects invalid input lower than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Invalid choice: 0
+ Invalid choices: 0
  Enter your answer:

[Timeout] BlockStatement
src/InputReader.js:43:64
             const invalidQueryTryAgain = `Invalid choice${
                 invalidAnswers.length > 1 ? "s" : ""
             }: ${invalidAnswers.join(", ")}\n${query}`;
-            this.rl.question(invalidQueryTryAgain, (answer) => {
-                this.handleAnswer(answer, question, query, resolve);
-            });
+            this.rl.question(invalidQueryTryAgain, (answer) => {});
             return;
         }

[Killed] ArrowFunction
src/InputReader.js:49:39
             return;
         }
 
-        resolve(answer.split(",").map((string) => parseInt(string)));
+        resolve(answer.split(",").map(() => undefined));
     }
 
killedBy: InputReader reads single input
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   undefined,

[Killed] BlockStatement
src/InputReader.js:55:41
     /**
      * @private
      */
-    getInvalidAnswers(answer, question) {
-        return answer
-            .split(",")
-            .map((string) => string.trim())
-            .filter((string) => {
-                const number = parseInt(string);
-                return !!(
-                    isNaN(number) ||
-                    number < 1 ||
-                    number > question.choices.length
-                );
-            });
-    }
+    getInvalidAnswers(answer, question) {}
 }
 
killedBy: InputReader reads single input
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/InputReader.js:56:16
      * @private
      */
     getInvalidAnswers(answer, question) {
-        return answer
-            .split(",")
-            .map((string) => string.trim())
-            .filter((string) => {
-                const number = parseInt(string);
-                return !!(
-                    isNaN(number) ||
-                    number < 1 ||
-                    number > question.choices.length
-                );
-            });
+        return answer.split(",").map(string => string.trim());
     }
 }
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 1
  Enter your answer:

[Killed] ArrowFunction
src/InputReader.js:58:18
     getInvalidAnswers(answer, question) {
         return answer
             .split(",")
-            .map((string) => string.trim())
+            .map(() => undefined)
             .filter((string) => {
                 const number = parseInt(string);
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 
  Enter your answer:

[Killed] MethodExpression
src/InputReader.js:58:30
     getInvalidAnswers(answer, question) {
         return answer
             .split(",")
-            .map((string) => string.trim())
+            .map((string) => string)
             .filter((string) => {
                 const number = parseInt(string);
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Invalid choices: 3, 5
+ Invalid choices:  3,  5 
  Enter your answer:

[Killed] BlockStatement
src/InputReader.js:59:33
         return answer
             .split(",")
             .map((string) => string.trim())
-            .filter((string) => {
-                const number = parseInt(string);
-                return !!(
-                    isNaN(number) ||
-                    number < 1 ||
-                    number > question.choices.length
-                );
-            });
+            .filter((string) => {});
     }
 }
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/InputReader.js:61:24
             .map((string) => string.trim())
             .filter((string) => {
                 const number = parseInt(string);
-                return !!(
-                    isNaN(number) ||
-                    number < 1 ||
-                    number > question.choices.length
-                );
+                return !(isNaN(number) || number < 1 || number > question.choices.length);
             });
     }
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 1
  Enter your answer:

[Killed] BooleanLiteral
src/InputReader.js:61:25
             .map((string) => string.trim())
             .filter((string) => {
                 const number = parseInt(string);
-                return !!(
-                    isNaN(number) ||
-                    number < 1 ||
-                    number > question.choices.length
-                );
+                return !isNaN(number) || number < 1 || number > question.choices.length;
             });
     }
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 1
  Enter your answer:

[Killed] LogicalOperator
src/InputReader.js:62:21
             .filter((string) => {
                 const number = parseInt(string);
                 return !!(
-                    isNaN(number) ||
-                    number < 1 ||
-                    number > question.choices.length
+                    (isNaN(number) || number < 1) && number > question.choices.length
                 );
             });
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/InputReader.js:62:21
             .filter((string) => {
                 const number = parseInt(string);
                 return !!(
-                    isNaN(number) ||
-                    number < 1 ||
+                    isNaN(number) && number < 1 ||
                     number > question.choices.length
                 );
killedBy: InputReader detects invalid input lower than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/InputReader.js:63:21
                 const number = parseInt(string);
                 return !!(
                     isNaN(number) ||
-                    number < 1 ||
+                    number <= 1 ||
                     number > question.choices.length
                 );
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 1
  Enter your answer:

[Killed] ConditionalExpression
src/InputReader.js:63:21
                 const number = parseInt(string);
                 return !!(
                     isNaN(number) ||
-                    number < 1 ||
+                    false ||
                     number > question.choices.length
                 );
killedBy: InputReader detects invalid input lower than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/InputReader.js:64:21
                 return !!(
                     isNaN(number) ||
                     number < 1 ||
-                    number > question.choices.length
+                    false
                 );
             });
killedBy: InputReader detects invalid input with multiple wrong choices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/InputReader.js:64:21
                 return !!(
                     isNaN(number) ||
                     number < 1 ||
-                    number > question.choices.length
+                    number <= question.choices.length
                 );
             });
killedBy: InputReader reads single input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

+ Invalid choice: 1
  Enter your answer:

[Killed] ObjectLiteral
src/InputReader.js:70:18
     }
 }
 
-module.exports = { InputReader };
+module.exports = {};
 
killedBy: InputReader reads single input
statusReason: TypeError: InputReader is not a constructor
