[Killed] BlockStatement
src/OutputManager.js:7:29
      * @param {string} message
      * @param {'red'|'green'?} color
      */
-    display(message, color) {
-        if (color === "red") {
-            console.log("\x1b[31m%s\x1b[0m", message);
-        } else if (color === "green") {
-            console.log("\x1b[32m%s\x1b[0m", message);
-        } else {
-            console.log(message);
-        }
-    }
+    display(message, color) {}
 }
 
killedBy: OutputManager displays message in default color
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"

Number of calls: 0

[Killed] ConditionalExpression
src/OutputManager.js:8:13
      * @param {'red'|'green'?} color
      */
     display(message, color) {
-        if (color === "red") {
+        if (true) {
             console.log("\x1b[31m%s\x1b[0m", message);
         } else if (color === "green") {
killedBy: OutputManager displays message in default color
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"
Received: "%s", "test"

Number of calls: 1

[Killed] ConditionalExpression
src/OutputManager.js:8:13
      * @param {'red'|'green'?} color
      */
     display(message, color) {
-        if (color === "red") {
+        if (false) {
             console.log("\x1b[31m%s\x1b[0m", message);
         } else if (color === "green") {
killedBy: OutputManager displays message in red
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "%s", "test"
Received: "test"

Number of calls: 1

[Killed] BlockStatement
src/OutputManager.js:10:39
     display(message, color) {
         if (color === "red") {
             console.log("\x1b[31m%s\x1b[0m", message);
-        } else if (color === "green") {
-            console.log("\x1b[32m%s\x1b[0m", message);
-        } else {
+        } else if (color === "green") {} else {
             console.log(message);
         }
killedBy: OutputManager displays message in green
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "%s", "test"

Number of calls: 0

[Killed] EqualityOperator
src/OutputManager.js:10:20
     display(message, color) {
         if (color === "red") {
             console.log("\x1b[31m%s\x1b[0m", message);
-        } else if (color === "green") {
+        } else if (color !== "green") {
             console.log("\x1b[32m%s\x1b[0m", message);
         } else {
killedBy: OutputManager displays message in default color
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"
Received: "%s", "test"

Number of calls: 1

[Killed] BlockStatement
src/OutputManager.js:12:16
             console.log("\x1b[31m%s\x1b[0m", message);
         } else if (color === "green") {
             console.log("\x1b[32m%s\x1b[0m", message);
-        } else {
-            console.log(message);
-        }
+        } else {}
     }
 }
killedBy: OutputManager displays message in default color
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test"

Number of calls: 0
