[Killed] BlockStatement
src/Question.js:14:42
      * @param {string[]} choices
      * @param {QuestionStrategy} strategy
      */
-    constructor(text, choices, strategy) {
-        this.text = text;
-        this.choices = choices;
-        this.strategy = strategy;
-    }
+    constructor(text, choices, strategy) {}
 }
 
killedBy: Question creates question
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Object {
-   "choices": Array [
-     "test",
