[Killed] BlockStatement
src/QuizManager.js:7:56
      * @param {OutputManager} outputManager
      * @param {InputReader} inputReader
      */
-    constructor(questions, outputManager, inputReader) {
-        if (questions.length === 0) {
-            throw new Error("No questions given");
-        }
-        this.questions = questions;
-        this.outputManager = outputManager;
-        this.inputReader = inputReader;
-        this.currentIndex = 0;
-    }
+    constructor(questions, outputManager, inputReader) {}
 
     async startQuiz() {
killedBy: QuizManager throws if no questions are given
statusReason: Error: expect(received).toThrow(expected)

Expected message: "No questions given"

Received function did not throw

[Killed] EqualityOperator
src/QuizManager.js:8:13
      * @param {InputReader} inputReader
      */
     constructor(questions, outputManager, inputReader) {
-        if (questions.length === 0) {
+        if (questions.length !== 0) {
             throw new Error("No questions given");
         }
killedBy: QuizManager throws if no questions are given
statusReason: Error: expect(received).toThrow(expected)

Expected message: "No questions given"

Received function did not throw

[Killed] ConditionalExpression
src/QuizManager.js:8:13
      * @param {InputReader} inputReader
      */
     constructor(questions, outputManager, inputReader) {
-        if (questions.length === 0) {
+        if (true) {
             throw new Error("No questions given");
         }
killedBy: QuizManager run quiz
statusReason: Error: No questions given

[Killed] BlockStatement
src/QuizManager.js:17:23
         this.currentIndex = 0;
     }
 
-    async startQuiz() {
-        this.displayQuestion();
-        await this.answerQuestion();
-    }
+    async startQuiz() {}
 
     /**
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "Question 1: foo"

Number of calls: 0

[Killed] BlockStatement
src/QuizManager.js:25:23
     /**
      * @private
      */
-    displayQuestion() {
-        const currentQuestion = this.questions[this.currentIndex];
-        this.outputManager.display(
-            `Question ${this.currentIndex + 1}: ${currentQuestion.text}`
-        );
-        currentQuestion.choices.forEach((choice, index) => {
-            this.outputManager.display(`${index + 1}. ${choice}`);
-        });
-    }
+    displayQuestion() {}
 
     /**
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "Question 1: foo"
Received
->     1: "Correct!
", "green"
       2: "Incorrect!

[Killed] ArithmeticOperator
src/QuizManager.js:28:25
     displayQuestion() {
         const currentQuestion = this.questions[this.currentIndex];
         this.outputManager.display(
-            `Question ${this.currentIndex + 1}: ${currentQuestion.text}`
+            `Question ${this.currentIndex - 1}: ${currentQuestion.text}`
         );
         currentQuestion.choices.forEach((choice, index) => {
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "Question 1: foo"
Received
->     1: "Question -1: foo"
       9: "Question 1: foo"

[Killed] BlockStatement
src/QuizManager.js:30:60
         this.outputManager.display(
             `Question ${this.currentIndex + 1}: ${currentQuestion.text}`
         );
-        currentQuestion.choices.forEach((choice, index) => {
-            this.outputManager.display(`${index + 1}. ${choice}`);
-        });
+        currentQuestion.choices.forEach((choice, index) => {});
     }
 
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: "1. bar"
Received
       1: "Question 1: foo"
->     2: "Correct!
", "green"

[Killed] ArithmeticOperator
src/QuizManager.js:31:43
             `Question ${this.currentIndex + 1}: ${currentQuestion.text}`
         );
         currentQuestion.choices.forEach((choice, index) => {
-            this.outputManager.display(`${index + 1}. ${choice}`);
+            this.outputManager.display(`${index - 1}. ${choice}`);
         });
     }
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: "1. bar"
Received
       1: "Question 1: foo"
->     2: "-1. bar"
       3: "0. baz"

[Killed] ConditionalExpression
src/QuizManager.js:44:13
         );
         const currentQuestion = this.questions[this.currentIndex];
 
-        if (currentQuestion.strategy.checkAnswer(answers)) {
+        if (true) {
             this.outputManager.display("Correct!\n", "green");
         } else {
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1]

Number of calls: 0

[Killed] ConditionalExpression
src/QuizManager.js:44:13
         );
         const currentQuestion = this.questions[this.currentIndex];
 
-        if (currentQuestion.strategy.checkAnswer(answers)) {
+        if (false) {
             this.outputManager.display("Correct!\n", "green");
         } else {
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [1]

Number of calls: 0

[Killed] StringLiteral
src/QuizManager.js:45:40
         const currentQuestion = this.questions[this.currentIndex];
 
         if (currentQuestion.strategy.checkAnswer(answers)) {
-            this.outputManager.display("Correct!\n", "green");
+            this.outputManager.display("", "green");
         } else {
             this.outputManager.display(
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 4
Expected: "Correct!
", "green"
Received
       3: "2. baz"
->     4: "", "green"

[Killed] BlockStatement
src/QuizManager.js:46:16
 
         if (currentQuestion.strategy.checkAnswer(answers)) {
             this.outputManager.display("Correct!\n", "green");
-        } else {
-            this.outputManager.display(
-                `Incorrect!\nCorrect answer${
-                    currentQuestion.strategy.correctAnswers.length !== 1
-                        ? "s"
-                        : ""
-                }: ${currentQuestion.strategy.correctAnswers.join(", ")}\n`,
-                "red"
-            );
-        }
+        } else {}
         this.currentIndex++;
         if (this.currentIndex < this.questions.length) {
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 8
Expected: "Incorrect!
Correct answers: 2, 3
", "red"
Received
       7: "2. fop"

[Killed] ConditionalExpression
src/QuizManager.js:49:21
         } else {
             this.outputManager.display(
                 `Incorrect!\nCorrect answer${
-                    currentQuestion.strategy.correctAnswers.length !== 1
+                    false
                         ? "s"
                         : ""
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 8
Expected: "Incorrect!
Correct answers: 2, 3
", "red"
Received
       7: "2. fop"

[Killed] ConditionalExpression
src/QuizManager.js:49:21
         } else {
             this.outputManager.display(
                 `Incorrect!\nCorrect answer${
-                    currentQuestion.strategy.correctAnswers.length !== 1
+                    true
                         ? "s"
                         : ""
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 12
Expected: "Incorrect!
Correct answer: 2
", "red"
Received
      11: "2. baz"

[Killed] UpdateOperator
src/QuizManager.js:56:9
                 "red"
             );
         }
-        this.currentIndex++;
+        this.currentIndex--;
         if (this.currentIndex < this.questions.length) {
             this.displayQuestion();
killedBy: QuizManager run quiz
statusReason: TypeError: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
src/QuizManager.js:57:13
             );
         }
         this.currentIndex++;
-        if (this.currentIndex < this.questions.length) {
+        if (true) {
             this.displayQuestion();
             await this.answerQuestion();
killedBy: QuizManager run quiz
statusReason: TypeError: Cannot read properties of undefined (reading 'text')

[Killed] EqualityOperator
src/QuizManager.js:57:13
             );
         }
         this.currentIndex++;
-        if (this.currentIndex < this.questions.length) {
+        if (this.currentIndex >= this.questions.length) {
             this.displayQuestion();
             await this.answerQuestion();
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 5
Expected: "Question 2: bar"
Received
       4: "Correct!
", "green"
->     5: "Quiz finished!"

[Killed] BlockStatement
src/QuizManager.js:60:16
         if (this.currentIndex < this.questions.length) {
             this.displayQuestion();
             await this.answerQuestion();
-        } else {
-            this.outputManager.display("Quiz finished!");
-        }
+        } else {}
     }
 }
killedBy: QuizManager run quiz
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 13
Expected: "Quiz finished!"
Received
      12: "Incorrect!
Correct answer: 2
", "red"
