[Killed] BlockStatement
src/strategies/MultipleChoiceStrategy.js:8:33
     /**
      * @param {number[]} correctAnswers
      */
-    constructor(correctAnswers) {
-        this.correctAnswers = correctAnswers;
-        this.maxAnswers = correctAnswers.length;
-    }
+    constructor(correctAnswers) {}
 
     /**
killedBy: MultipleChoiceStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/strategies/MultipleChoiceStrategy.js:17:30
      * @param {number[]} userAnswers
      * @returns {boolean}
      */
-    checkAnswer(userAnswers) {
-        if (this.correctAnswers.length !== userAnswers.length) {
-            return false;
-        }
-
-        return this.correctAnswers.every((answer) =>
-            userAnswers.includes(answer)
-        );
-    }
+    checkAnswer(userAnswers) {}
 }
 
killedBy: MultipleChoiceStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/strategies/MultipleChoiceStrategy.js:18:13
      * @returns {boolean}
      */
     checkAnswer(userAnswers) {
-        if (this.correctAnswers.length !== userAnswers.length) {
+        if (this.correctAnswers.length === userAnswers.length) {
             return false;
         }
killedBy: MultipleChoiceStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/strategies/MultipleChoiceStrategy.js:18:64
      * @returns {boolean}
      */
     checkAnswer(userAnswers) {
-        if (this.correctAnswers.length !== userAnswers.length) {
-            return false;
-        }
+        if (this.correctAnswers.length !== userAnswers.length) {}
 
         return this.correctAnswers.every((answer) =>
killedBy: MultipleChoiceStrategy checkAnswer() returns false if wrong number of answers are given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/strategies/MultipleChoiceStrategy.js:19:20
      */
     checkAnswer(userAnswers) {
         if (this.correctAnswers.length !== userAnswers.length) {
-            return false;
+            return true;
         }
 
killedBy: MultipleChoiceStrategy checkAnswer() returns false if wrong number of answers are given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/strategies/MultipleChoiceStrategy.js:22:42
             return false;
         }
 
-        return this.correctAnswers.every((answer) =>
-            userAnswers.includes(answer)
+        return this.correctAnswers.every(() => undefined
         );
     }
killedBy: MultipleChoiceStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/strategies/MultipleChoiceStrategy.js:22:16
             return false;
         }
 
-        return this.correctAnswers.every((answer) =>
-            userAnswers.includes(answer)
-        );
+        return this.correctAnswers.some(answer => userAnswers.includes(answer));
     }
 }
killedBy: MultipleChoiceStrategy checkAnswer() returns false if any answer is incorrect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
src/strategies/MultipleChoiceStrategy.js:28:18
     }
 }
 
-module.exports = { MultipleChoiceStrategy };
+module.exports = {};
 
killedBy: MultipleChoiceStrategy checkAnswer() returns true if all answers are correct
statusReason: TypeError: MultipleChoiceStrategy is not a constructor
