[Killed] BlockStatement
src/strategies/MultipleCorrectAnswersStrategy.js:8:33
     /**
      * @param {number[]} correctAnswers
      */
-    constructor(correctAnswers) {
-        this.correctAnswers = correctAnswers;
-        this.maxAnswers = 1;
-    }
+    constructor(correctAnswers) {}
 
     /**
killedBy: MultipleCorrectAnswersStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/strategies/MultipleCorrectAnswersStrategy.js:17:30
      * @param {number[]} userAnswers
      * @returns {boolean}
      */
-    checkAnswer(userAnswers) {
-        return (
-            userAnswers.length === 1 &&
-            this.correctAnswers.includes(userAnswers[0])
-        );
-    }
+    checkAnswer(userAnswers) {}
 }
 
killedBy: MultipleCorrectAnswersStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/strategies/MultipleCorrectAnswersStrategy.js:19:13
      */
     checkAnswer(userAnswers) {
         return (
-            userAnswers.length === 1 &&
-            this.correctAnswers.includes(userAnswers[0])
+            false
         );
     }
killedBy: MultipleCorrectAnswersStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/strategies/MultipleCorrectAnswersStrategy.js:19:13
      */
     checkAnswer(userAnswers) {
         return (
-            userAnswers.length === 1 &&
+            userAnswers.length !== 1 &&
             this.correctAnswers.includes(userAnswers[0])
         );
killedBy: MultipleCorrectAnswersStrategy checkAnswer() returns true if all answers are correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
