[Killed] BlockStatement
src/strategies/SingleAnswerStrategy.js:8:33
     /**
      * @param {number[]} correctAnswers
      */
-    constructor(correctAnswers) {
-        if (correctAnswers.length !== 1) {
-            throw new Error(
-                `SingleAnswerStrategy requires exactly 1 answer, got ${correctAnswers.length}`
-            );
-        }
-        this.correctAnswers = correctAnswers;
-        this.maxAnswers = 1;
-    }
+    constructor(correctAnswers) {}
 
     /**
killedBy: SingleAnswerStrategy throws if not exactly 1 answer given
statusReason: Error: expect(received).toThrow(expected)

Expected message: "SingleAnswerStrategy requires exactly 1 answer, got 3"

Received function did not throw

[Killed] BlockStatement
src/strategies/SingleAnswerStrategy.js:9:42
      * @param {number[]} correctAnswers
      */
     constructor(correctAnswers) {
-        if (correctAnswers.length !== 1) {
-            throw new Error(
-                `SingleAnswerStrategy requires exactly 1 answer, got ${correctAnswers.length}`
-            );
-        }
+        if (correctAnswers.length !== 1) {}
         this.correctAnswers = correctAnswers;
         this.maxAnswers = 1;
killedBy: SingleAnswerStrategy throws if not exactly 1 answer given
statusReason: Error: expect(received).toThrow(expected)

Expected message: "SingleAnswerStrategy requires exactly 1 answer, got 3"

Received function did not throw

[Killed] ConditionalExpression
src/strategies/SingleAnswerStrategy.js:9:13
      * @param {number[]} correctAnswers
      */
     constructor(correctAnswers) {
-        if (correctAnswers.length !== 1) {
+        if (false) {
             throw new Error(
                 `SingleAnswerStrategy requires exactly 1 answer, got ${correctAnswers.length}`
killedBy: SingleAnswerStrategy throws if not exactly 1 answer given
statusReason: Error: expect(received).toThrow(expected)

Expected message: "SingleAnswerStrategy requires exactly 1 answer, got 3"

Received function did not throw

[Killed] BlockStatement
src/strategies/SingleAnswerStrategy.js:22:30
      * @param {number[]} userAnswers
      * @returns {boolean}
      */
-    checkAnswer(userAnswers) {
-        return (
-            userAnswers.length === 1 &&
-            this.correctAnswers[0] === userAnswers[0]
-        );
-    }
+    checkAnswer(userAnswers) {}
 }
 
killedBy: SingleAnswerStrategy checkAnswer() returns false if wrong answer given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] LogicalOperator
src/strategies/SingleAnswerStrategy.js:24:13
      */
     checkAnswer(userAnswers) {
         return (
-            userAnswers.length === 1 &&
-            this.correctAnswers[0] === userAnswers[0]
+            userAnswers.length === 1 || this.correctAnswers[0] === userAnswers[0]
         );
     }
killedBy: SingleAnswerStrategy checkAnswer() returns false if wrong answer given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/strategies/SingleAnswerStrategy.js:24:13
      */
     checkAnswer(userAnswers) {
         return (
-            userAnswers.length === 1 &&
-            this.correctAnswers[0] === userAnswers[0]
+            false
         );
     }
killedBy: SingleAnswerStrategy checkAnswer() returns true if correct answer given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/strategies/SingleAnswerStrategy.js:25:13
     checkAnswer(userAnswers) {
         return (
             userAnswers.length === 1 &&
-            this.correctAnswers[0] === userAnswers[0]
+            this.correctAnswers[0] !== userAnswers[0]
         );
     }
killedBy: SingleAnswerStrategy checkAnswer() returns false if wrong answer given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/strategies/SingleAnswerStrategy.js:25:13
     checkAnswer(userAnswers) {
         return (
             userAnswers.length === 1 &&
-            this.correctAnswers[0] === userAnswers[0]
+            true
         );
     }
killedBy: SingleAnswerStrategy checkAnswer() returns false if wrong answer given
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
